IDENTIFICATION DIVISION.
PROGRAM-ID. CRD0030.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. IBM-370.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-INPUT.
    COPY CRD0030C REPLACING ==:PFX:== BY ==AC==.
01 WS-RESULTS.
    05 WS-CLIM            PIC 9(7)V99 VALUE ZERO.
PROCEDURE DIVISION.
A000-MAIN.
    ACCEPT WS-INPUT
    PERFORM ASSIGN-LIMIT
    DISPLAY "WS-CLIM=" WS-CLIM
    STOP RUN.
ASSIGN-LIMIT.
    IF AC-WS-CSCR >= 760
        COMPUTE WS-CLIM ROUNDED = AC-WS-ANINC * 0.25
    ELSE
        IF AC-WS-CSCR >= 680
            COMPUTE WS-CLIM ROUNDED = AC-WS-ANINC * 0.20
        ELSE
            MOVE 500.00 TO WS-CLIM
        END-IF
    END-IF.
