    *> PRIOR BANKRUPTCY Y/N
    05 :PFX:-BANKRUPTCY-FLAG PIC X.
    *> YEARS SINCE BANKRUPTCY DISCHARGE
    05 :PFX:-BK-YEARS        PIC 9(2).
    *> BUREAU CREDIT SCORE
    05 :PFX:-CR-SCORE        PIC 9(3).
