    *> PRIOR BANKRUPTCY Y/N
    05 BANKRUPTCY-FLAG    PIC X.
       88 BANKRUPTCY-BANKRUPT VALUE 'Y'.
    05 YRS-SINCE-BK       PIC 9(2).
    *> BUREAU CREDIT SCORE
    05 BUREAU-SCORE       PIC 9(3).
