IDENTIFICATION DIVISION.
PROGRAM-ID. CRD0005.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. IBM-370.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 INPUT-AREA.
    COPY CRD0005C.
01 WS-RESULTS.
    05 A-DC               PIC X VALUE 'D'.
        88 A-DECLINED VALUE 'D'.
        88 A-REFERRED VALUE 'R'.
    05 RC-CD              PIC X(3) VALUE SPACES.
PROCEDURE DIVISION.
MAINLINE.
    ACCEPT INPUT-AREA
    PERFORM 2500-BK-RULES
    DISPLAY "A-DC=" A-DC
    DISPLAY "RC-CD=" RC-CD
    STOP RUN.
2500-BK-RULES.
    IF BK-BANKRUPT
        IF WS-BKY < 5
            SET A-DECLINED TO TRUE
            MOVE 'BK1' TO RC-CD
        ELSE
            SET A-REFERRED TO TRUE
            MOVE 'BK2' TO RC-CD
        END-IF
    END-IF.
