IDENTIFICATION DIVISION.
PROGRAM-ID. CRD0034.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 INPUT-AREA.
    05 CS-SCR             PIC 9(3).
    05 D-IR               PIC 9V99.
01 WS-OUT-REC.
    05 A-DC               PIC X VALUE 'D'.
PROCEDURE DIVISION.
0000-MAIN.
    ACCEPT INPUT-AREA
    PERFORM CREDIT-CUTOFF
    DISPLAY "A-DC=" A-DC
    STOP RUN.
CREDIT-CUTOFF.
    IF CS-SCR >= 740 AND D-IR < 0.35
        MOVE 'A' TO A-DC
    ELSE
        IF CS-SCR >= 680
            MOVE 'R' TO A-DC
        ELSE
            MOVE 'D' TO A-DC
        END-IF
    END-IF.
