    *> BUREAU CREDIT SCORE
    05 CREDIT-SCORE       PIC 9(3).
    *> DEBT TO INCOME RATIO
    05 DTI-RATIO          PIC 9V99.
    05 POST-DATE          PIC 9(8).
    05 POST-DATE-R REDEFINES POST-DATE.
       10 POST-DATE-YYYY  PIC 9(4).
       10 POST-DATE-MM    PIC 9(2).
       10 POST-DATE-DD    PIC 9(2).
    05 FILLER             PIC X(4).
