    *> ACCOUNT TYPE S=SAVINGS C=CHECKING P=PREMIUM G=GOLD B=BUSINESS F=FIXED
    05 AT-CD              PIC X.
       88 AT-BUSINESS VALUE 'B'.
    *> TRANSACTIONS THIS MONTH
    05 WS-MTC             PIC 9(3).
    05 POST-DATE          PIC 9(8).
    05 POST-DATE-R REDEFINES POST-DATE.
       10 POST-DATE-YYYY  PIC 9(4).
       10 POST-DATE-MM    PIC 9(2).
       10 POST-DATE-DD    PIC 9(2).
    05 FILLER             PIC X(2).
