    *> ACCOUNT TYPE S=SAVINGS C=CHECKING P=PREMIUM G=GOLD B=BUSINESS F=FIXED
    05 :PFX:-ACCOUNT-TYPE    PIC X.
    *> AVERAGE MONTHLY BALANCE
    05 :PFX:-AVG-BALANCE     PIC 9(7)V99.
