IDENTIFICATION DIVISION.
PROGRAM-ID. FEE0001.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-IN-REC.
    COPY FEE0001C REPLACING ==:PFX:== BY ==CU==.
01 RESULT-AREA.
    05 FEE-WAIVER-FLG     PIC X VALUE 'N'.
    05 SVC-CHARGE         PIC 9(3)V99 VALUE ZERO.
PROCEDURE DIVISION.
A000-MAIN.
    ACCEPT WS-IN-REC
    PERFORM 2000-FEE-WAIVER
    DISPLAY "FEE-WAIVER-FLG=" FEE-WAIVER-FLG
    DISPLAY "SVC-CHARGE=" SVC-CHARGE
    STOP RUN.
2000-FEE-WAIVER.
    IF CU-ACCOUNT-TYPE = 'G'
       OR 'P'
       OR CU-AVG-BALANCE >= 1500
        MOVE 'Y' TO FEE-WAIVER-FLG
        MOVE 0 TO SVC-CHARGE
    ELSE
        MOVE 10.00 TO SVC-CHARGE
    END-IF.
