    *> ACCOUNT TYPE S=SAVINGS C=CHECKING P=PREMIUM G=GOLD B=BUSINESS F=FIXED
    05 ACCOUNT-TYPE       PIC X.
    *> TRANSACTIONS THIS MONTH
    05 TXN-COUNT-MTH      PIC 9(3).
