    *> ACCOUNT TYPE S=SAVINGS C=CHECKING P=PREMIUM G=GOLD B=BUSINESS F=FIXED
    05 ACCT-TYPE          PIC X.
    *> TRANSACTIONS THIS MONTH
    05 MONTHLY-TXNS       PIC 9(3).
