    *> ACCOUNT TYPE S=SAVINGS C=CHECKING P=PREMIUM G=GOLD B=BUSINESS F=FIXED
    05 ACCT-TYP           PIC X.
    *> AVERAGE MONTHLY BALANCE
    05 MEAN-BAL           PIC 9(7)V99.
