IDENTIFICATION DIVISION.
PROGRAM-ID. FEE0015.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. IBM-370.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 IN-RECORD.
    05 WS-STU             PIC X.
    05 CA-AGE             PIC 9(3).
01 WS-OUT-REC.
    05 W-IN               PIC X VALUE 'N'.
    05 WS-MFEE            PIC 9(3)V99 VALUE ZERO.
PROCEDURE DIVISION.
MAIN-PARA.
    ACCEPT IN-RECORD
    PERFORM FEE-CONCESSION
    DISPLAY "W-IN=" W-IN
    DISPLAY "WS-MFEE=" WS-MFEE
    STOP RUN.
FEE-CONCESSION.
    EVALUATE TRUE
        WHEN WS-STU = 'Y' AND CA-AGE LESS THAN 25
            MOVE 'Y' TO W-IN
            MOVE 0 TO WS-MFEE
        WHEN CA-AGE NOT < 60
            MOVE 'Y' TO W-IN
            MOVE 0 TO WS-MFEE
        WHEN OTHER
            MOVE 6 TO WS-MFEE
    END-EVALUATE.
