    05 :PFX:-TXN-CHANNEL     PIC X.
    05 :PFX:-CARD-PRESENT    PIC X.
    *> TRANSACTION AMOUNT
    05 :PFX:-TXN-AMT         PIC 9(7)V99.
    05 :PFX:-RUN-DATE        PIC 9(8).
    05 :PFX:-RUN-DATE-R REDEFINES :PFX:-RUN-DATE.
       10 :PFX:-RUN-DATE-YYYY  PIC 9(4).
       10 :PFX:-RUN-DATE-MM    PIC 9(2).
       10 :PFX:-RUN-DATE-DD    PIC 9(2).
    05 FILLER             PIC X(2).
