    05 :PFX:-TRAN-CNT-DAY    PIC 9(3).
    05 :PFX:-TXN-AMOUNT      PIC 9(7)V99.
    *> DAYS SINCE ACCOUNT OPENED
    05 :PFX:-ACCT-AGE-DAYS   PIC 9(5).
    05 :PFX:-PROC-DATE       PIC 9(8).
    05 :PFX:-PROC-DATE-R REDEFINES :PFX:-PROC-DATE.
       10 :PFX:-PROC-DATE-YYYY  PIC 9(4).
       10 :PFX:-PROC-DATE-MM    PIC 9(2).
       10 :PFX:-PROC-DATE-DD    PIC 9(2).
    05 FILLER             PIC X(4).
