    05 :PFX:-WS-CHN          PIC X.
    *> CARD PRESENT Y/N
    05 :PFX:-CP-FLG          PIC X.
    *> TRANSACTION AMOUNT
    05 :PFX:-WS-TXAMT        PIC 9(7)V99.
