IDENTIFICATION DIVISION.
PROGRAM-ID. FRD0049.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 INPUT-AREA.
    COPY FRD0049C.
01 WS-OUT-REC.
    05 FLAG-REVIEW        PIC X VALUE 'N'.
        88 FLAG-REVIEW-NEEDED VALUE 'Y'.
PROCEDURE DIVISION.
MAIN-PARA.
    ACCEPT INPUT-AREA
    PERFORM CHECK-TXN
    PERFORM HIGH-RISK-REGION
    DISPLAY "FLAG-REVIEW=" FLAG-REVIEW
    STOP RUN.
CHECK-TXN.
    IF CUSTOMER-AGE < 16 AND TRAN-AMT GREATER THAN 7500
        SET FLAG-REVIEW-NEEDED TO TRUE
    END-IF.
HIGH-RISK-REGION.
    IF TRAN-AMT GREATER THAN 25000.00 AND COUNTRY-IS-XC
        SET FLAG-REVIEW-NEEDED TO TRUE
    END-IF.
