IDENTIFICATION DIVISION.
PROGRAM-ID. FRD0046.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 IN-RECORD.
    05 CUST-AGE           PIC 9(3).
    05 TXN-AMT            PIC 9(7)V99.
    05 COUNTRY-CD         PIC X(2).
    05 POST-DATE          PIC 9(8).
    05 POST-DATE-R REDEFINES POST-DATE.
       10 POST-DATE-YYYY  PIC 9(4).
       10 POST-DATE-MM    PIC 9(2).
       10 POST-DATE-DD    PIC 9(2).
    05 FILLER             PIC X(4).
01 OUT-RECORD.
    05 RVW-IND            PIC X VALUE 'N'.
PROCEDURE DIVISION.
A000-MAIN.
    ACCEPT IN-RECORD
    PERFORM MINOR-TXN-CHECK
    PERFORM 2100-REGION-CHECK
    DISPLAY "RVW-IND=" RVW-IND
    STOP RUN.
MINOR-TXN-CHECK.
    IF CUST-AGE < 18 AND TXN-AMT > 3500
        MOVE 'Y' TO RVW-IND
    END-IF.
2100-REGION-CHECK.
    IF TXN-AMT > 90000 AND COUNTRY-CD = 'XA'
        MOVE 'Y' TO RVW-IND
    END-IF.
