IDENTIFICATION DIVISION.
PROGRAM-ID. FRD0025.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. IBM-370.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-IN-REC.
    COPY FRD0025C.
01 WS-RESULTS.
    05 FLAG-REVIEW        PIC X VALUE 'N'.
PROCEDURE DIVISION.
MAINLINE.
    ACCEPT WS-IN-REC
    PERFORM MINOR-TXN-CHECK
    DISPLAY "FLAG-REVIEW=" FLAG-REVIEW
    STOP RUN.
MINOR-TXN-CHECK.
    IF CLNT-AGE LESS THAN 16
       AND TXN-AMT GREATER THAN 4500
        MOVE 'Y' TO FLAG-REVIEW
    END-IF.
