*> ********************************************************
*> PROGRAM : FRD0005
*> PURPOSE : FRAUD SCORING RULES
*> AUTHOR  : A.W.
*> CHANGE LOG:
*>   1992-02-19 ORIGINAL VERSION
*>   2009-11-06 THRESHOLDS UPDATED PER AUDIT REQ 953
*> RUN FROM JCL JOB FRDNIGHT STEP090
*> ********************************************************
IDENTIFICATION DIVISION.
PROGRAM-ID. FRD0005.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. IBM-370.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-IN-REC.
    COPY FRD0005C REPLACING ==:PFX:== BY ==TX==.
01 WS-RESULTS.
    05 WS-RSK             PIC X VALUE 'L'.
    05 RS-SC              PIC 9(3) VALUE ZERO.
PROCEDURE DIVISION.
0000-MAIN.
    ACCEPT WS-IN-REC
    PERFORM 3000-VELOCITY-SCORE
    DISPLAY "WS-RSK=" WS-RSK
    DISPLAY "RS-SC=" RS-SC
    STOP RUN.
3000-VELOCITY-SCORE.
    EVALUATE TRUE
        WHEN TX-D-TC > 20
           AND TX-TA-AMT > 7000
            MOVE 'H' TO WS-RSK
            MOVE 90 TO RS-SC
        *> ELEVATED TRANSACTION VELOCITY
        WHEN TX-D-TC > 10
            MOVE 'M' TO WS-RSK
            MOVE 60 TO RS-SC
        *> ACTIVITY ON NEW ACCOUNT
        WHEN TX-WS-AGEDD < 30
            MOVE 'M' TO WS-RSK
            MOVE 40 TO RS-SC
        WHEN OTHER
            MOVE 'L' TO WS-RSK
            MOVE 10 TO RS-SC
    END-EVALUATE.
