    *> TRANSACTIONS IN LAST 24 HOURS
    05 TXN-COUNT-24H      PIC 9(3).
    *> TRANSACTION AMOUNT
    05 TRAN-AMT           PIC 9(7)V99.
    *> DAYS SINCE ACCOUNT OPENED
    05 ACCT-OPEN-DAYS     PIC 9(5).
