    *> CUSTOMER AGE IN YEARS
    05 WS-CAGE            PIC 9(3).
    *> TRANSACTION AMOUNT
    05 WS-TXAMT           PIC 9(7)V99.
    *> ORIGIN COUNTRY CODE
    05 WS-CTRY            PIC X(2).
