    05 WS-TCNT            PIC 9(3).
    *> TRANSACTION AMOUNT
    05 WS-TXAMT           PIC 9(7)V99.
    *> DAYS SINCE ACCOUNT OPENED
    05 WS-AGEDD           PIC 9(5).
