    *> ACCOUNT TYPE S=SAVINGS C=CHECKING P=PREMIUM G=GOLD B=BUSINESS F=FIXED
    05 ACCT-TYPE          PIC X.
    *> CURRENT LEDGER BALANCE
    05 ACCT-BALANCE       PIC 9(9)V99.
