    *> CUSTOMER AGE IN YEARS
    05 C-AG-YY            PIC 9(3).
    05 L-BL               PIC 9(9)V99.
    *> ACCOUNT TYPE S=SAVINGS C=CHECKING P=PREMIUM G=GOLD B=BUSINESS F=FIXED
    05 A-TY               PIC X.
    *> BASE INTEREST RATE
    05 S-RT               PIC 9V9999.
