IDENTIFICATION DIVISION.
PROGRAM-ID. INT0033.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. IBM-370.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 INPUT-AREA.
    COPY INT0033C.
01 RESULT-AREA.
    05 I-RT1              PIC 9V9999 VALUE ZERO.
PROCEDURE DIVISION.
MAIN-PARA.
    ACCEPT INPUT-AREA
    PERFORM TERM-DEPOSIT-RATE
    DISPLAY "I-RT1=" I-RT1
    STOP RUN.
TERM-DEPOSIT-RATE.
    IF TRM-BAND-1-6
        MOVE 0.0300 TO I-RT1
    ELSE IF TRM-BAND-7-12
        MOVE 0.0375 TO I-RT1
    ELSE IF TRM-BAND-13-36
        MOVE 0.0450 TO I-RT1
    ELSE
        MOVE 0.0150 TO I-RT1
    END-IF
    END-IF
    END-IF.
