IDENTIFICATION DIVISION.
PROGRAM-ID. INT0006.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 INPUT-AREA.
    05 TM-MM              PIC 9(3).
01 WS-RESULTS.
    05 WS-IRT             PIC 9V9999 VALUE ZERO.
PROCEDURE DIVISION.
MAINLINE.
    ACCEPT INPUT-AREA
    PERFORM TERM-DEPOSIT-RATE
    DISPLAY "WS-IRT=" WS-IRT
    STOP RUN.
TERM-DEPOSIT-RATE.
    EVALUATE TM-MM
        WHEN 1 THRU 6
            MOVE 0.0300 TO WS-IRT
        WHEN 7 THRU 18
            MOVE 0.0375 TO WS-IRT
        WHEN 19 THRU 36
            MOVE 0.0450 TO WS-IRT
        WHEN OTHER
            MOVE 0.0200 TO WS-IRT
    END-EVALUATE.
