IDENTIFICATION DIVISION.
PROGRAM-ID. INT0010.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. IBM-370.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 IN-RECORD.
    COPY INT0010C.
01 OUT-RECORD.
    05 INT-RATE           PIC 9V9999 VALUE ZERO.
PROCEDURE DIVISION.
MAINLINE.
    ACCEPT IN-RECORD
    PERFORM SET-SAVINGS-RATE
    DISPLAY "INT-RATE=" INT-RATE
    STOP RUN.
SET-SAVINGS-RATE.
    IF ACCT-TYPE = 'S' AND ACCT-BALANCE >= 100000
        MOVE 0.0450 TO INT-RATE
    ELSE
        IF ACCT-TYPE = 'S' AND ACCT-BALANCE >= 25000
            MOVE 0.0350 TO INT-RATE
        ELSE
            IF ACCT-TYPE = 'S'
                MOVE 0.0275 TO INT-RATE
            ELSE
                MOVE 0.0100 TO INT-RATE
            END-IF
        END-IF
    END-IF.
