IDENTIFICATION DIVISION.
PROGRAM-ID. INT0043.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 IN-RECORD.
    COPY INT0043C REPLACING ==:PFX:== BY ==TX==.
01 WS-OUT-REC.
    05 IR-RT              PIC 9V9999 VALUE ZERO.
PROCEDURE DIVISION.
MAIN-PARA.
    ACCEPT IN-RECORD
    PERFORM 2000-RATE-TIER
    DISPLAY "IR-RT=" IR-RT
    STOP RUN.
2000-RATE-TIER.
    IF A-SAVINGS
       AND TX-CB-AMT GREATER THAN OR EQUAL TO 50000.00
        MOVE 0.0475 TO IR-RT
    ELSE
        IF A-SAVINGS
           AND TX-CB-AMT >= 10000
            MOVE 0.0375 TO IR-RT
        ELSE
            IF A-SAVINGS
                MOVE 0.0300 TO IR-RT
            ELSE
                MOVE 0.0100 TO IR-RT
            END-IF
        END-IF
    END-IF.
