    *> ACCOUNT TYPE S=SAVINGS C=CHECKING P=PREMIUM G=GOLD B=BUSINESS F=FIXED
    05 A-TY               PIC X.
    *> CURRENT LEDGER BALANCE
    05 L-BL               PIC 9(9)V99.
    05 RUN-DATE           PIC 9(8).
    05 RUN-DATE-R REDEFINES RUN-DATE.
       10 RUN-DATE-YYYY  PIC 9(4).
       10 RUN-DATE-MM    PIC 9(2).
       10 RUN-DATE-DD    PIC 9(2).
    05 FILLER             PIC X(4).
