IDENTIFICATION DIVISION.
PROGRAM-ID. INT0039.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. IBM-370.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-INPUT.
    05 DEP-TERM-MM        PIC 9(3).
01 RESULT-AREA.
    05 INT-RATE           PIC 9V9999 VALUE ZERO.
PROCEDURE DIVISION.
A000-MAIN.
    ACCEPT WS-INPUT
    PERFORM 3000-TERM-RATE
    DISPLAY "INT-RATE=" INT-RATE
    STOP RUN.
3000-TERM-RATE.
    IF DEP-TERM-MM >= 1 AND DEP-TERM-MM <= 3
        MOVE 0.0275 TO INT-RATE
    ELSE IF DEP-TERM-MM >= 4 AND DEP-TERM-MM <= 18
        MOVE 0.0350 TO INT-RATE
    ELSE IF DEP-TERM-MM >= 19 AND DEP-TERM-MM <= 60
        MOVE 0.0425 TO INT-RATE
    ELSE
        MOVE 0.0200 TO INT-RATE
    END-IF
    END-IF
    END-IF.
