    *> DEPOSIT TERM IN MONTHS
    05 DEPOSIT-TERM       PIC 9(3).
       88 DEPOSIT-BAND-1-6 VALUE 1 THRU 6.
       88 DEPOSIT-BAND-7-18 VALUE 7 THRU 18.
       88 DEPOSIT-BAND-19-60 VALUE 19 THRU 60.
    05 PROC-DATE          PIC 9(8).
    05 PROC-DATE-R REDEFINES PROC-DATE.
       10 PROC-DATE-YYYY  PIC 9(4).
       10 PROC-DATE-MM    PIC 9(2).
       10 PROC-DATE-DD    PIC 9(2).
    05 FILLER             PIC X(6).
