    05 CLNT-AGE           PIC 9(3).
    05 CURR-BAL           PIC 9(9)V99.
    05 ACCT-TYP           PIC X.
    05 STD-RATE           PIC 9V9999.
    05 PROC-DATE          PIC 9(8).
    05 PROC-DATE-R REDEFINES PROC-DATE.
       10 PROC-DATE-YYYY  PIC 9(4).
       10 PROC-DATE-MM    PIC 9(2).
       10 PROC-DATE-DD    PIC 9(2).
    05 FILLER             PIC X(2).
