    05 :PFX:-DEPOSIT-TERM    PIC 9(3).
       88 DEPOSIT-BAND-1-3 VALUE 1 THRU 3.
       88 DEPOSIT-BAND-4-12 VALUE 4 THRU 12.
       88 DEPOSIT-BAND-13-36 VALUE 13 THRU 36.
