IDENTIFICATION DIVISION.
PROGRAM-ID. INT0046.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 IN-RECORD.
    COPY INT0046C REPLACING ==:PFX:== BY ==AC==.
01 WS-RESULTS.
    05 INTEREST-RATE      PIC 9V9999 VALUE ZERO.
PROCEDURE DIVISION.
MAIN-PARA.
    ACCEPT IN-RECORD
    PERFORM APPLY-INT-TIER
    DISPLAY "INTEREST-RATE=" INTEREST-RATE
    STOP RUN.
APPLY-INT-TIER.
    EVALUATE TRUE
        WHEN AC-ACCOUNT-TYPE = 'S'
           AND AC-ACCT-BALANCE NOT LESS THAN 100000
            MOVE 0.0425 TO INTEREST-RATE
        WHEN AC-ACCOUNT-TYPE EQUAL TO 'S'
           AND AC-ACCT-BALANCE NOT < 10000
            MOVE 0.0325 TO INTEREST-RATE
        WHEN AC-ACCOUNT-TYPE = 'S'
            MOVE 0.0250 TO INTEREST-RATE
        WHEN OTHER
            MOVE 0.0100 TO INTEREST-RATE
    END-EVALUATE.
