IDENTIFICATION DIVISION.
PROGRAM-ID. INT0049.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 IN-RECORD.
    COPY INT0049C REPLACING ==:PFX:== BY ==CU==.
01 OUT-RECORD.
    05 APPLIED-RATE       PIC 9V9999 VALUE ZERO.
PROCEDURE DIVISION.
MAINLINE.
    ACCEPT IN-RECORD
    PERFORM SET-SAVINGS-RATE
    DISPLAY "APPLIED-RATE=" APPLIED-RATE
    STOP RUN.
SET-SAVINGS-RATE.
    IF ACCT-SAVINGS AND CU-CURR-BAL >= 50000.00
        MOVE 0.0425 TO APPLIED-RATE
    ELSE IF ACCT-SAVINGS AND CU-CURR-BAL >= 10000.00
        MOVE 0.0325 TO APPLIED-RATE
    ELSE IF ACCT-SAVINGS
        MOVE 0.0250 TO APPLIED-RATE
    ELSE
        MOVE 0.0100 TO APPLIED-RATE
    END-IF
    END-IF
    END-IF.
