    *> ACCOUNT TYPE S=SAVINGS C=CHECKING P=PREMIUM G=GOLD B=BUSINESS F=FIXED
    05 ACCT-TYP           PIC X.
    *> CURRENT LEDGER BALANCE
    05 LEDGER-BAL         PIC 9(9)V99.
