    *> ACCOUNT TYPE S=SAVINGS C=CHECKING P=PREMIUM G=GOLD B=BUSINESS F=FIXED
    05 :PFX:-A-TY            PIC X.
    *> CURRENT LEDGER BALANCE
    05 :PFX:-L-BL            PIC 9(9)V99.
