    *> CUSTOMER AGE IN YEARS
    05 :PFX:-CUSTOMER-AGE    PIC 9(3).
    *> CURRENT LEDGER BALANCE
    05 :PFX:-CURR-BAL        PIC 9(9)V99.
    *> ACCOUNT TYPE S=SAVINGS C=CHECKING P=PREMIUM G=GOLD B=BUSINESS F=FIXED
    05 :PFX:-ACCT-TYPE       PIC X.
       88 ACCT-FIXED VALUE 'F'.
    *> BASE INTEREST RATE
    05 :PFX:-BASE-RATE       PIC 9V9999.
