IDENTIFICATION DIVISION.
PROGRAM-ID. INT0009.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 IN-RECORD.
    COPY INT0009C.
01 WS-RESULTS.
    05 INT-RATE           PIC 9V9999 VALUE ZERO.
PROCEDURE DIVISION.
MAIN-PARA.
    ACCEPT IN-RECORD
    PERFORM TERM-DEPOSIT-RATE
    DISPLAY "INT-RATE=" INT-RATE
    STOP RUN.
TERM-DEPOSIT-RATE.
    EVALUATE TRUE
        WHEN TERM-MONTHS >= 1 AND <= 6
            MOVE 0.0275 TO INT-RATE
        WHEN TERM-MONTHS >= 7 AND <= 12
            MOVE 0.0350 TO INT-RATE
        WHEN TERM-MONTHS >= 13 AND <= 60
            MOVE 0.0425 TO INT-RATE
        WHEN OTHER
            MOVE 0.0150 TO INT-RATE
    END-EVALUATE.
