IDENTIFICATION DIVISION.
PROGRAM-ID. INT0022.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 INPUT-AREA.
    COPY INT0022C.
01 OUT-RECORD.
    05 INTEREST-RATE      PIC 9V9999 VALUE ZERO.
PROCEDURE DIVISION.
MAINLINE.
    ACCEPT INPUT-AREA
    PERFORM 2000-RATE-TIER
    DISPLAY "INTEREST-RATE=" INTEREST-RATE
    STOP RUN.
2000-RATE-TIER.
    EVALUATE TRUE
        WHEN ACCOUNT-TYPE = 'S' AND CURR-BAL >= 50000
            MOVE 0.0425 TO INTEREST-RATE
        WHEN ACCOUNT-TYPE = 'S'
           AND CURR-BAL >= 20000
            MOVE 0.0325 TO INTEREST-RATE
        WHEN ACCOUNT-TYPE = 'S'
            MOVE 0.0250 TO INTEREST-RATE
        WHEN OTHER
            MOVE 0.0100 TO INTEREST-RATE
    END-EVALUATE.
