IDENTIFICATION DIVISION.
PROGRAM-ID. LON0041.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. IBM-370.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 IN-RECORD.
    COPY LON0041C REPLACING ==:PFX:== BY ==CU==.
01 WS-RESULTS.
    05 TERM-CAP           PIC 9(2) VALUE ZERO.
    05 ELIGIBLE-FLAG      PIC X VALUE 'N'.
        88 ELIGIBLE-ELIGIBLE VALUE 'Y'.
PROCEDURE DIVISION.
0000-MAIN.
    ACCEPT IN-RECORD
    PERFORM TERM-BY-AGE
    DISPLAY "TERM-CAP=" TERM-CAP
    DISPLAY "ELIGIBLE-FLAG=" ELIGIBLE-FLAG
    STOP RUN.
TERM-BY-AGE.
    *>  OLD CHECK REMOVED 2004
    *>  IF CU-CUSTOMER-AGE > 48
    *>      PERFORM 9000-OLD-HANDLING
    *>  END-IF
    IF CU-CUSTOMER-AGE >= 18
        IF CU-CUSTOMER-AGE GREATER THAN 60
            MOVE 10 TO TERM-CAP
            MOVE 'Y' TO ELIGIBLE-FLAG
        ELSE IF CU-CUSTOMER-AGE > 55
            MOVE 20 TO TERM-CAP
            SET ELIGIBLE-ELIGIBLE TO TRUE
        ELSE
            MOVE 30 TO TERM-CAP
            SET ELIGIBLE-ELIGIBLE TO TRUE
        END-IF
        END-IF
    ELSE
        MOVE 'N' TO ELIGIBLE-FLAG
    END-IF.
