IDENTIFICATION DIVISION.
PROGRAM-ID. LON0013.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. IBM-370.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-IN-REC.
    05 JOB-TENURE         PIC 9(2).
    05 GROSS-INCOME       PIC 9(7)V99.
01 WS-RESULTS.
    05 LOAN-CEILING       PIC 9(9)V99 VALUE ZERO.
PROCEDURE DIVISION.
A000-MAIN.
    ACCEPT WS-IN-REC
    PERFORM INCOME-MULTIPLE
    DISPLAY "LOAN-CEILING=" LOAN-CEILING
    STOP RUN.
INCOME-MULTIPLE.
    IF JOB-TENURE NOT LESS THAN 5
        COMPUTE LOAN-CEILING = GROSS-INCOME * 4
    ELSE
        IF JOB-TENURE GREATER THAN OR EQUAL TO 2
            COMPUTE LOAN-CEILING = GROSS-INCOME * 3
        ELSE
            COMPUTE LOAN-CEILING ROUNDED = GROSS-INCOME * 2
        END-IF
    END-IF.
