IDENTIFICATION DIVISION.
PROGRAM-ID. LON0028.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-IN-REC.
    COPY LON0028C REPLACING ==:PFX:== BY ==IN==.
01 WS-RESULTS.
    05 MAX-LOAN-AMT       PIC 9(9)V99 VALUE ZERO.
PROCEDURE DIVISION.
MAINLINE.
    ACCEPT WS-IN-REC
    PERFORM INCOME-MULTIPLE
    DISPLAY "MAX-LOAN-AMT=" MAX-LOAN-AMT
    STOP RUN.
INCOME-MULTIPLE.
    IF IN-JOB-TENURE >= 5
        COMPUTE MAX-LOAN-AMT = IN-GROSS-INCOME * 5
    ELSE
        IF IN-JOB-TENURE >= 2
            COMPUTE MAX-LOAN-AMT ROUNDED = IN-GROSS-INCOME * 3
        ELSE
            COMPUTE MAX-LOAN-AMT = IN-GROSS-INCOME * 2
        END-IF
    END-IF.
