IDENTIFICATION DIVISION.
PROGRAM-ID. LON0001.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 IN-RECORD.
    05 YRS-EMPLOYED       PIC 9(2).
    05 ANN-INCOME         PIC 9(7)V99.
01 WS-OUT-REC.
    05 MAX-PRINCIPAL      PIC 9(9)V99 VALUE ZERO.
PROCEDURE DIVISION.
A000-MAIN.
    ACCEPT IN-RECORD
    PERFORM 2000-LOAN-MULTIPLE
    DISPLAY "MAX-PRINCIPAL=" MAX-PRINCIPAL
    STOP RUN.
2000-LOAN-MULTIPLE.
    EVALUATE TRUE
        WHEN YRS-EMPLOYED >= 7
            COMPUTE MAX-PRINCIPAL = ANN-INCOME * 4
        WHEN YRS-EMPLOYED >= 3
            COMPUTE MAX-PRINCIPAL ROUNDED = ANN-INCOME * 3
        WHEN OTHER
            COMPUTE MAX-PRINCIPAL = ANN-INCOME * 1.5
    END-EVALUATE.
