IDENTIFICATION DIVISION.
PROGRAM-ID. LON0031.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. IBM-370.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-IN-REC.
    COPY LON0031C REPLACING ==:PFX:== BY ==TX==.
01 RESULT-AREA.
    05 MAX-LOAN-AMT       PIC 9(9)V99 VALUE ZERO.
PROCEDURE DIVISION.
MAINLINE.
    ACCEPT WS-IN-REC
    PERFORM MAX-LOAN-CALC
    DISPLAY "MAX-LOAN-AMT=" MAX-LOAN-AMT
    STOP RUN.
MAX-LOAN-CALC.
    EVALUATE TRUE
        WHEN TX-EMPLOY-YEARS >= 5
            COMPUTE MAX-LOAN-AMT = TX-ANNUAL-INCOME * 4
        WHEN TX-EMPLOY-YEARS >= 2
            COMPUTE MAX-LOAN-AMT = TX-ANNUAL-INCOME * 3
        WHEN OTHER
            COMPUTE MAX-LOAN-AMT = TX-ANNUAL-INCOME * 2
    END-EVALUATE.
