IDENTIFICATION DIVISION.
PROGRAM-ID. LON0029.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. IBM-370.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-IN-REC.
    COPY LON0029C REPLACING ==:PFX:== BY ==AC==.
01 OUT-RECORD.
    05 MAX-TERM           PIC 9(2) VALUE ZERO.
    05 LOAN-ELIGIBLE      PIC X VALUE 'N'.
PROCEDURE DIVISION.
A000-MAIN.
    ACCEPT WS-IN-REC
    PERFORM 2500-AGE-TERM
    DISPLAY "MAX-TERM=" MAX-TERM
    DISPLAY "LOAN-ELIGIBLE=" LOAN-ELIGIBLE
    STOP RUN.
2500-AGE-TERM.
    IF AC-CUST-AGE >= 18
        EVALUATE TRUE
            WHEN AC-CUST-AGE > 60
                MOVE 10 TO MAX-TERM
                MOVE 'Y' TO LOAN-ELIGIBLE
            WHEN AC-CUST-AGE > 55
                MOVE 20 TO MAX-TERM
                MOVE 'Y' TO LOAN-ELIGIBLE
            WHEN OTHER
                MOVE 30 TO MAX-TERM
                MOVE 'Y' TO LOAN-ELIGIBLE
        END-EVALUATE
    ELSE
        MOVE 'N' TO LOAN-ELIGIBLE
    END-IF.
