IDENTIFICATION DIVISION.
PROGRAM-ID. LON0048.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. IBM-370.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 IN-RECORD.
    COPY LON0048C REPLACING ==:PFX:== BY ==IN==.
01 WS-RESULTS.
    05 MORT-INS-IND       PIC X VALUE 'N'.
    05 RATE-LOAD          PIC 9V9999 VALUE ZERO.
PROCEDURE DIVISION.
A000-MAIN.
    ACCEPT IN-RECORD
    PERFORM MORTGAGE-INS-CHECK
    DISPLAY "MORT-INS-IND=" MORT-INS-IND
    DISPLAY "RATE-LOAD=" RATE-LOAD
    STOP RUN.
MORTGAGE-INS-CHECK.
    IF IN-LTV-PCT > 85
        MOVE 'Y' TO MORT-INS-IND
        MOVE 0.0050 TO RATE-LOAD
    ELSE
        MOVE 'N' TO MORT-INS-IND
    END-IF.
