    05 :PFX:-JOB-TENURE      PIC 9(2).
    *> GROSS ANNUAL INCOME
    05 :PFX:-ANN-INCOME      PIC 9(7)V99.
    05 :PFX:-PROC-DATE       PIC 9(8).
    05 :PFX:-PROC-DATE-R REDEFINES :PFX:-PROC-DATE.
       10 :PFX:-PROC-DATE-YYYY  PIC 9(4).
       10 :PFX:-PROC-DATE-MM    PIC 9(2).
       10 :PFX:-PROC-DATE-DD    PIC 9(2).
    05 FILLER             PIC X(4).
