IDENTIFICATION DIVISION.
PROGRAM-ID. LON0007.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-IN-REC.
    05 EY-YY              PIC 9(2).
    05 WS-ANINC           PIC 9(7)V99.
01 RESULT-AREA.
    05 ML-AMT             PIC 9(9)V99 VALUE ZERO.
PROCEDURE DIVISION.
MAIN-PARA.
    ACCEPT WS-IN-REC
    PERFORM 2000-LOAN-MULTIPLE
    DISPLAY "ML-AMT=" ML-AMT
    STOP RUN.
2000-LOAN-MULTIPLE.
    EVALUATE TRUE
        WHEN EY-YY >= 7
            COMPUTE ML-AMT = WS-ANINC * 4
        WHEN EY-YY >= 2
            COMPUTE ML-AMT = WS-ANINC * 3
        WHEN OTHER
            COMPUTE ML-AMT = WS-ANINC * 2
    END-EVALUATE.
