IDENTIFICATION DIVISION.
PROGRAM-ID. LON0039.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 INPUT-AREA.
    COPY LON0039C REPLACING ==:PFX:== BY ==IN==.
01 WS-OUT-REC.
    05 M-II               PIC X VALUE 'N'.
    05 WS-RADJ            PIC 9V9999 VALUE ZERO.
PROCEDURE DIVISION.
A000-MAIN.
    ACCEPT INPUT-AREA
    PERFORM 3000-LTV-RULES
    DISPLAY "M-II=" M-II
    DISPLAY "WS-RADJ=" WS-RADJ
    STOP RUN.
3000-LTV-RULES.
    IF IN-LV-PC > 90
        MOVE 'Y' TO M-II
        MOVE 0.0025 TO WS-RADJ
    ELSE
        MOVE 'N' TO M-II
    END-IF.
