IDENTIFICATION DIVISION.
PROGRAM-ID. LON0023.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. IBM-370.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 IN-RECORD.
    05 CUSTOMER-AGE       PIC 9(3).
01 WS-RESULTS.
    05 MAX-TERM           PIC 9(2) VALUE ZERO.
    05 LOAN-ELIGIBLE      PIC X VALUE 'N'.
PROCEDURE DIVISION.
0000-MAIN.
    ACCEPT IN-RECORD
    PERFORM LOAN-TERM-RULES
    DISPLAY "MAX-TERM=" MAX-TERM
    DISPLAY "LOAN-ELIGIBLE=" LOAN-ELIGIBLE
    STOP RUN.
LOAN-TERM-RULES.
    IF CUSTOMER-AGE >= 18
        EVALUATE TRUE
            WHEN CUSTOMER-AGE > 65
                MOVE 10 TO MAX-TERM
                MOVE 'Y' TO LOAN-ELIGIBLE
            WHEN CUSTOMER-AGE GREATER THAN 55
                MOVE 20 TO MAX-TERM
                MOVE 'Y' TO LOAN-ELIGIBLE
            WHEN OTHER
                MOVE 30 TO MAX-TERM
                MOVE 'Y' TO LOAN-ELIGIBLE
        END-EVALUATE
    ELSE
        MOVE 'N' TO LOAN-ELIGIBLE
    END-IF.
