    05 FIRST-OFFENSE      PIC X.
    *> TIER G=GOLD P=PLATINUM S=SILVER B=BASIC
    05 CUSTOMER-TIER      PIC X.
    *> DAYS PAYMENT IS LATE
    05 DAYS-PAST-DUE      PIC 9(3).
