IDENTIFICATION DIVISION.
PROGRAM-ID. PEN0034.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. IBM-370.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 IN-RECORD.
    COPY PEN0034C REPLACING ==:PFX:== BY ==IN==.
01 WS-RESULTS.
    05 LATE-CHARGE        PIC 9(5)V99 VALUE ZERO.
PROCEDURE DIVISION.
0000-MAIN.
    ACCEPT IN-RECORD
    PERFORM ASSESS-PENALTY
    DISPLAY "LATE-CHARGE=" LATE-CHARGE
    STOP RUN.
ASSESS-PENALTY.
    EVALUATE TRUE
        WHEN IN-DAYS-LATE >= 1 AND IN-DAYS-LATE <= 10
            MOVE 25 TO LATE-CHARGE
        WHEN IN-DAYS-LATE >= 11 AND IN-DAYS-LATE <= 30
            MOVE 35 TO LATE-CHARGE
        WHEN IN-DAYS-LATE >= 31 AND IN-DAYS-LATE <= 999
            COMPUTE LATE-CHARGE ROUNDED = IN-AMT-DUE * 0.05
        WHEN OTHER
            MOVE 0 TO LATE-CHARGE
    END-EVALUATE.
