    05 FIRST-OFFENSE      PIC X.
    05 CUST-TIER          PIC X.
    05 DAYS-PAST-DUE      PIC 9(3).
    05 PROC-DATE          PIC 9(8).
    05 PROC-DATE-R REDEFINES PROC-DATE.
       10 PROC-DATE-YYYY  PIC 9(4).
       10 PROC-DATE-MM    PIC 9(2).
       10 PROC-DATE-DD    PIC 9(2).
    05 FILLER             PIC X(2).
