    *> LATE PAYMENTS IN LAST 12 MONTHS
    05 LATE-PMTS-YR       PIC 9(2).
    05 DAYS-PAST-DUE      PIC 9(3).
    05 PROC-DATE          PIC 9(8).
    05 PROC-DATE-R REDEFINES PROC-DATE.
       10 PROC-DATE-YYYY  PIC 9(4).
       10 PROC-DATE-MM    PIC 9(2).
       10 PROC-DATE-DD    PIC 9(2).
    05 FILLER             PIC X(4).
