    *> LATE PAYMENTS IN LAST 12 MONTHS
    05 LATE-PMTS-YR       PIC 9(2).
    *> DAYS PAYMENT IS LATE
    05 DAYS-PAST-DUE      PIC 9(3).
    05 RUN-DATE           PIC 9(8).
    05 RUN-DATE-R REDEFINES RUN-DATE.
       10 RUN-DATE-YYYY  PIC 9(4).
       10 RUN-DATE-MM    PIC 9(2).
       10 RUN-DATE-DD    PIC 9(2).
    05 FILLER             PIC X(2).
