    *> FIRST LATE PAYMENT Y/N
    05 FIRST-LATE-IND     PIC X.
    *> TIER G=GOLD P=PLATINUM S=SILVER B=BASIC
    05 CUST-TIER          PIC X.
    *> DAYS PAYMENT IS LATE
    05 DAYS-LATE          PIC 9(3).
