IDENTIFICATION DIVISION.
PROGRAM-ID. PEN0025.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. IBM-370.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-INPUT.
    COPY PEN0025C.
01 WS-RESULTS.
    05 PA-AMT             PIC 9(5)V99 VALUE ZERO.
PROCEDURE DIVISION.
0000-MAIN.
    ACCEPT WS-INPUT
    PERFORM CALC-LATE-FEE
    DISPLAY "PA-AMT=" PA-AMT
    STOP RUN.
CALC-LATE-FEE.
    IF WS-DLT >= 1 AND WS-DLT <= 15
        MOVE 15.00 TO PA-AMT
    ELSE IF DLT-BAND-16-30
        MOVE 50.00 TO PA-AMT
    ELSE IF WS-DLT >= 31 AND WS-DLT <= 999
        COMPUTE PA-AMT = WS-BDUE * 0.08
    ELSE
        MOVE 0 TO PA-AMT
    END-IF
    END-IF
    END-IF.
