IDENTIFICATION DIVISION.
PROGRAM-ID. PEN0043.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-INPUT.
    COPY PEN0043C REPLACING ==:PFX:== BY ==AC==.
01 WS-OUT-REC.
    05 WS-PEN             PIC 9(5)V99 VALUE ZERO.
PROCEDURE DIVISION.
MAINLINE.
    ACCEPT WS-INPUT
    PERFORM 2000-LATE-PENALTY
    DISPLAY "WS-PEN=" WS-PEN
    STOP RUN.
2000-LATE-PENALTY.
    EVALUATE AC-D-PD
        WHEN 1 THRU 15
            MOVE 25 TO WS-PEN
        WHEN 16 THRU 30
            MOVE 50.00 TO WS-PEN
        WHEN 31 THRU 999
            COMPUTE WS-PEN = AC-BD-AMT * 0.08
        WHEN OTHER
            MOVE 0.00 TO WS-PEN
    END-EVALUATE.
