    *> FIRST LATE PAYMENT Y/N
    05 :PFX:-FIRST-OFFENSE   PIC X.
    *> TIER G=GOLD P=PLATINUM S=SILVER B=BASIC
    05 :PFX:-CUST-TIER       PIC X.
    *> DAYS PAYMENT IS LATE
    05 :PFX:-DAYS-PAST-DUE   PIC 9(3).
    05 :PFX:-RUN-DATE        PIC 9(8).
    05 :PFX:-RUN-DATE-R REDEFINES :PFX:-RUN-DATE.
       10 :PFX:-RUN-DATE-YYYY  PIC 9(4).
       10 :PFX:-RUN-DATE-MM    PIC 9(2).
       10 :PFX:-RUN-DATE-DD    PIC 9(2).
    05 FILLER             PIC X(2).
