    *> FIRST LATE PAYMENT Y/N
    05 FIRST-LATE-IND     PIC X.
       88 FIRST-FIRST-TIME VALUE 'Y'.
    *> TIER G=GOLD P=PLATINUM S=SILVER B=BASIC
    05 CUSTOMER-TIER      PIC X.
    *> DAYS PAYMENT IS LATE
    05 DPD-DAYS           PIC 9(3).
