    *> FIRST LATE PAYMENT Y/N
    05 FO-IND             PIC X.
    *> TIER G=GOLD P=PLATINUM S=SILVER B=BASIC
    05 WS-TIER            PIC X.
    *> DAYS PAYMENT IS LATE
    05 DL-DD              PIC 9(3).
