*> ********************************************************
*> PROGRAM : PEN0019
*> PURPOSE : PENALTY ASSESSMENT RULES
*> AUTHOR  : M.S.
*> CHANGE LOG:
*>   1992-07-15 ORIGINAL VERSION
*>   1998-10-03 THRESHOLDS UPDATED PER AUDIT REQ 399
*> RUN FROM JCL JOB PENNIGHT STEP060
*> ********************************************************
IDENTIFICATION DIVISION.
PROGRAM-ID. PEN0019.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. IBM-370.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 IN-RECORD.
    COPY PEN0019C.
01 WS-RESULTS.
    05 WS-PEN             PIC 9(5)V99 VALUE ZERO.
PROCEDURE DIVISION.
MAIN-PARA.
    ACCEPT IN-RECORD
    PERFORM 2000-LATE-PENALTY
    DISPLAY "WS-PEN=" WS-PEN
    STOP RUN.
2000-LATE-PENALTY.
    *> EARLY LATE PAYMENT FEE
    IF DL-DD >= 1 AND <= 15
        MOVE 25 TO WS-PEN
    ELSE
        IF DL-DD >= 16 AND <= 45
            MOVE 35 TO WS-PEN
        ELSE
            *> SERIOUSLY LATE PAYMENT PENALTY
            IF DL-DD >= 46 AND <= 999
                COMPUTE WS-PEN ROUNDED = S-DU * 0.05
            ELSE
                MOVE 0 TO WS-PEN
            END-IF
        END-IF
    END-IF.
