IDENTIFICATION DIVISION.
PROGRAM-ID. TXNCHK.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-IN-REC.
   05 CUST-AGE      PIC 9(3).
   05 TXN-AMOUNT    PIC 9(7)V99.
01 FLAG-REVIEW      PIC X VALUE 'N'.
PROCEDURE DIVISION.
MAIN-PARA.
    ACCEPT WS-IN-REC
    PERFORM CHECK-TXN
    DISPLAY "FLAG-REVIEW=" FLAG-REVIEW
    STOP RUN.
CHECK-TXN.
    IF CUST-AGE < 18 AND TXN-AMOUNT > 5000
        MOVE 'Y' TO FLAG-REVIEW
    END-IF.
